In [1]:
print("EDA - MINOR Project")

EDA - MINOR Project

In [5]:
# Import Libraries

import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

### Importing all the data in to DataFrame

In [6]:
customers = pd.read_csv('data/Customers.csv')
customers.head()

,customer_id,full_name,email,phone,city,age
0,CUST1000,Ishita Shah,suresh.khan426@gmail.com,5.432087e+09,Ahmedbad,66.0
1,CUST1001,Anita Singh,priya.shah608@gmail.com,8.416988e+09,Chennai,35.0
2,CUST1002,Arjun Khan,ishita.shah208@gmail.com,9.985288e+09,Hydrabad,32.0
3,CUST1003,Priya Singh,mira.singh941@gmail.com,5.150250e+09,Pune,0.0
4,CUST1004,Anita Gupta,suresh.khan169@gmail.com,2.925093e+09,Chennai,39.0

In [7]:
medicine = pd.read_csv('data/Medicine.csv')
medicine.head()

  medicine_id medicine_name type_id  price       brand
0     MED2000      Drug4806  TYP112  319.0  Dr Reddy's
1     MED2001        Drug13  TYP119  407.0  Dr Reddy's
2     MED2002      Drug3936  TYP105  421.0       Cipla
3     MED2003      Drug1057  TYP117  197.0  Dr Reddy's
4     MED2004      Drug2648  TYP136  170.0      Pfizer

In [8]:
pharmacy = pd.read_csv('data/PharmacyShops.csv')
pharmacy.head()

    shop_id location  manager_name  rating
0  SHOP3000    Delhi   Kabir Gupta     4.4
1  SHOP3001  Chennai  Ishita Reddy     4.8
2  SHOP3002  Chennai   Diya Sharma     4.9
3  SHOP3003  Chennai    Anaya Shah     3.1
4  SHOP3004     Pune    Anita Shah     4.0

In [9]:
prescriptions = pd.read_csv('data/Prescriptions.csv')
prescriptions.head()

  prescription_id customer_id     doctor_name medicine_id        date dosage
0        PRES4000    CUST6748     Suresh Shah     MED2818  2020-11-28  0-0-1
1        PRES4001    CUST2270  Arjun Kulkarni     MED2192  2021-09-16  2-0-2
2        PRES4002    CUST5535       Arjun Das     MED2232  2025-03-03  1-1-1
3        PRES4003    CUST2466    Anita Kapoor     MED2285  2024-11-21  2-0-2
4        PRES4004    CUST1100     Sneha Reddy     MED2471  2019-05-09  2-0-2

In [10]:
purchases = pd.read_csv('data/Purchases.csv')
purchases.head()

,purchase_id,medicine_id,shop_id,supplier_name,purchase_date,quantity,cost_price
0,PUR6000,MED2892,SHOP3057,MedLink,2023-05-02,49,237
1,PUR6001,MED2191,SHOP3020,MedLink,2023-03-20,90,155
2,PUR6002,MED2810,SHOP3003,LifeLine,2020-10-17,63,127
3,PUR6003,MED2841,SHOP3115,HealthCorp,2020-07-29,47,133
4,PUR6004,MED2313,SHOP3113,MedLink,2021-03-11,72,261

In [11]:
sales_bills = pd.read_csv('data/SalesBills.csv')
sales_bills.head()

,sale_id,customer_id,medicine_id,shop_id,sale_date,quantity,discount,final_price,payment_mode,status,Unnamed: 10
0,SALE5000,CUST4690,MED2187,SHOP3026,2022-08-15,1,3.03,483.0,Card,Cancelled,NaN
1,SALE5001,CUST4223,MED2350,SHOP3002,2020-06-27,3,18.92,565.0,UPI,Pending,NaN
2,SALE5002,CUST1800,MED2419,SHOP3116,2025-05-26,1,13.77,204.0,Cash,Cancelled,NaN
3,SALE5003,CUST1404,MED2620,SHOP3052,2024-03-31,3,7.00,756.0,Cash,Completed,NaN
4,SALE5004,CUST4957,MED2509,SHOP3135,2025-04-01,3,17.64,533.0,Cash,Completed,NaN

In [13]:
stocks = pd.read_csv('data/Stocks.csv')
stocks.head()

  stock_id   shop_id medicine_id  available_units last_updated
0  STK7000  SHOP3024     MED2298             35.0   2024-02-04
1  STK7001  SHOP3015     MED2078             30.0   2022-03-14
2  STK7002  SHOP3077     MED2932             36.0   2024-11-21
3  STK7003  SHOP3128     MED2396             44.0   2022-11-06
4  STK7004  SHOP3098     MED2110             28.0   2023-11-25

In [15]:
med_type = pd.read_csv('data/TypesofMedicine.csv')
med_type.head()

  type_id type_name    category
0  TYP100    Powder  Painkiller
1  TYP101     Syrup   Antiviral
2  TYP102    Tablet  Painkiller
3  TYP103    Tablet     Antacid
4  TYP104     Cream  Painkiller

### EDA on Customers data

In [19]:
customers.sample(10)

,customer_id,full_name,email,phone,city,age
4806,CUST5806,Aarav Sharma,rohan.reddy424@gmail.com,7.999880e+09,Mumbai,3.0
4547,CUST5547,Kabir Patel,sneha.sharma8@gmail.com,4.839670e+09,Jaipur,58.0
5390,CUST6390,Suresh Sharma,anaya.nair410@gmail.com,9.766740e+09,Chennai,41.0
2939,CUST3939,Sneha Gupta,priya.nair764@gmail.com,3.172245e+09,Hydrabad,48.0
4412,CUST5412,Mira Kapoor,priya.singh613@gmail.com,9.904128e+09,Hydrabad,44.0
3493,CUST4493,Aarav Khan,suresh.singh615@gmail.com,7.616717e+09,Chennai,45.0
4087,CUST5087,Priya Kapoor,suresh.khan218@gmail.com,5.617604e+09,Bangalore,47.0
3411,CUST4411,Rahul Shah,arjun.kapoor793@gmail.com,7.947205e+09,Delhi,53.0
3843,CUST4843,Rohan Nair,anita.das681@gmail.com,3.374223e+09,Suratt,32.0
5620,CUST6620,Priya Singh,mira.kapoor234@gmail.com,1.031042e+09,Chennai,56.0

In [16]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6000 entries, 0 to 5999
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  6000 non-null   object
 1   full_name    6000 non-null   object
 2   email        5693 non-null   object
 3   phone        5753 non-null   float64
 4   city         6000 non-null   object
 5   age          5687 non-null   float64
dtypes: float64(2), object(4)
memory usage: 281.4+ KB

In [17]:
customers.describe()

              phone          age
count  5.753000e+03  5687.000000
mean   5.062068e+09    39.580622
std    2.863052e+09    15.053071
min    1.924947e+06   -11.000000
25%    2.572259e+09    29.000000
50%    5.141119e+09    39.000000
75%    7.520223e+09    50.000000
max    9.999635e+09    90.000000

In [18]:
customers.isnull().sum()

customer_id      0
full_name        0
email          307
phone          247
city             0
age            313
dtype: int64